In [4]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.master('local[2]').appName("Spark_Exe").getOrCreate()
print(spark)
data = [('James','','Smith','1991-04-01','M',3000,'jfghsrsvstejxfmdhcjmxdgncg'),
  ('Michael','Rose','','2000-05-19','M',4000,'dythszacfhverhznvbgh'),
  ('Robert','','Williams','1978-09-05','M',4000,'efbvhdzbfivblaenlfhb'),
  ('Maria','Anne','Jones','1967-12-01','F',4000,'sfhbvaaLbrlijWGLFBSlKJV'),
  ('Jen','Mary','Brown','1980-02-17','F',-1,'ERHGALJFHBVLJAEBUABVJ')
]

columns = ["firstname","middlename","lastname","dob","gender","salary","comment"] 
df = spark.createDataFrame(data = data,schema = columns)

<pyspark.sql.session.SparkSession object at 0x00000249C5243D50>

In [5]:
help(df.show)

Help on method show in module pyspark.sql.dataframe:

show(n: int = 20, truncate: Union[bool, int] = True, vertical: bool = False) -> None method of pyspark.sql.dataframe.DataFrame instance
    Prints the first ``n`` rows to the console.

    .. versionadded:: 1.3.0

    .. versionchanged:: 3.4.0
        Supports Spark Connect.

    Parameters
    ----------
    n : int, optional
        Number of rows to show.
    truncate : bool or int, optional
        If set to ``True``, truncate strings longer than 20 chars by default.
        If set to a number greater than one, truncates long strings to length ``truncate``
        and align cells right.
    vertical : bool, optional
        If set to ``True``, print output rows vertically (one line
        per column value).

    Examples
    --------
    >>> df = spark.createDataFrame([
    ...     (14, "Tom"), (23, "Alice"), (16, "Bob")], ["age", "name"])

    Show only top 2 rows.

    >>> df.show(2)
    +---+-----+
    |age| name|
    +---+-----+
    | 14|  Tom|
    | 23|Alice|
    +---+-----+
    only showing top 2 rows

    Show :class:`DataFrame` where the maximum number of characters is 3.

    >>> df.show(truncate=3)
    +---+----+
    |age|name|
    +---+----+
    | 14| Tom|
    | 23| Ali|
    | 16| Bob|
    +---+----+

    Show :class:`DataFrame` vertically.

    >>> df.show(vertical=True)
    -RECORD 0-----
    age  | 14
    name | Tom
    -RECORD 1-----
    age  | 23
    name | Alice
    -RECORD 2-----
    age  | 16
    name | Bob

In [6]:
# it will display 20 characters of each column values
# to get the default 20 rows of data
df.show()

+---------+----------+--------+----------+------+------+--------------------+
|firstname|middlename|lastname|       dob|gender|salary|             comment|
+---------+----------+--------+----------+------+------+--------------------+
|    James|          |   Smith|1991-04-01|     M|  3000|jfghsrsvstejxfmdh...|
|  Michael|      Rose|        |2000-05-19|     M|  4000|dythszacfhverhznvbgh|
|   Robert|          |Williams|1978-09-05|     M|  4000|efbvhdzbfivblaenlfhb|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|sfhbvaaLbrlijWGLF...|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|ERHGALJFHBVLJAEBU...|
+---------+----------+--------+----------+------+------+--------------------+

In [7]:
df.show(truncate=5)  # it will display 5 characters of each column values

+---------+----------+--------+-----+------+------+-------+
|firstname|middlename|lastname|  dob|gender|salary|comment|
+---------+----------+--------+-----+------+------+-------+
|    James|          |   Smith|19...|     M|  3000|  jf...|
|    Mi...|      Rose|        |20...|     M|  4000|  dy...|
|    Ro...|          |   Wi...|19...|     M|  4000|  ef...|
|    Maria|      Anne|   Jones|19...|     F|  4000|  sf...|
|      Jen|      Mary|   Brown|19...|     F|    -1|  ER...|
+---------+----------+--------+-----+------+------+-------+

In [8]:
# if truncate is False then it will print complete value of each column values
df.show(truncate=False)

+---------+----------+--------+----------+------+------+--------------------------+
|firstname|middlename|lastname|dob       |gender|salary|comment                   |
+---------+----------+--------+----------+------+------+--------------------------+
|James    |          |Smith   |1991-04-01|M     |3000  |jfghsrsvstejxfmdhcjmxdgncg|
|Michael  |Rose      |        |2000-05-19|M     |4000  |dythszacfhverhznvbgh      |
|Robert   |          |Williams|1978-09-05|M     |4000  |efbvhdzbfivblaenlfhb      |
|Maria    |Anne      |Jones   |1967-12-01|F     |4000  |sfhbvaaLbrlijWGLFBSlKJV   |
|Jen      |Mary      |Brown   |1980-02-17|F     |-1    |ERHGALJFHBVLJAEBUABVJ     |
+---------+----------+--------+----------+------+------+--------------------------+

In [10]:
# set all the data vertically by using the vertical parameter as True
df.show(truncate=False,vertical =True)

-RECORD 0--------------------------------
 firstname  | James
 middlename |
 lastname   | Smith
 dob        | 1991-04-01
 gender     | M
 salary     | 3000
 comment    | jfghsrsvstejxfmdhcjmxdgncg
-RECORD 1--------------------------------
 firstname  | Michael
 middlename | Rose
 lastname   |
 dob        | 2000-05-19
 gender     | M
 salary     | 4000
 comment    | dythszacfhverhznvbgh
-RECORD 2--------------------------------
 firstname  | Robert
 middlename |
 lastname   | Williams
 dob        | 1978-09-05
 gender     | M
 salary     | 4000
 comment    | efbvhdzbfivblaenlfhb
-RECORD 3--------------------------------
 firstname  | Maria
 middlename | Anne
 lastname   | Jones
 dob        | 1967-12-01
 gender     | F
 salary     | 4000
 comment    | sfhbvaaLbrlijWGLFBSlKJV
-RECORD 4--------------------------------
 firstname  | Jen
 middlename | Mary
 lastname   | Brown
 dob        | 1980-02-17
 gender     | F
 salary     | -1
 comment    | ERHGALJFHBVLJAEBUABVJ

In [12]:
# n is the number of rows you want to show in display
# it will dispaly the 3 rows of data
df.show(3,truncate=False)

+---------+----------+--------+----------+------+------+--------------------------+
|firstname|middlename|lastname|dob       |gender|salary|comment                   |
+---------+----------+--------+----------+------+------+--------------------------+
|James    |          |Smith   |1991-04-01|M     |3000  |jfghsrsvstejxfmdhcjmxdgncg|
|Michael  |Rose      |        |2000-05-19|M     |4000  |dythszacfhverhznvbgh      |
|Robert   |          |Williams|1978-09-05|M     |4000  |efbvhdzbfivblaenlfhb      |
+---------+----------+--------+----------+------+------+--------------------------+
only showing top 3 rows